{"nbformat":4,"nbformat_minor":0,"metadata":{"kernelspec":{"display_name":"Python 3","language":"python","name":"python3"},"language_info":{"codemirror_mode":{"name":"ipython","version":3},"file_extension":".py","mimetype":"text/x-python","name":"python","nbconvert_exporter":"python","pygments_lexer":"ipython3","version":"3.8.4"},"colab":{"name":"REAL_01_DataLoadingAndExploration.ipynb","provenance":[],"collapsed_sections":[]}},"cells":[{"cell_type":"markdown","metadata":{"id":"cu59iJ3PGlWX"},"source":["# Requirements\n","\n","If you have not created your Neo4J Sandbox yet, please run the pre-setup notebook to do sp."]},{"cell_type":"markdown","metadata":{"id":"ZoaqhgJQC_fC"},"source":["# Setup\n","\n","Install the necessary library in your Colab notebook environment and connect to your hosted Neo4J Sandbox."]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"JmHymBmsVYqx","executionInfo":{"status":"ok","timestamp":1623140272480,"user_tz":-120,"elapsed":3380,"user":{"displayName":"Raphaël Azorin","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gg1zZn5o5tIlK5J3P6RdcBMqTBjo6bOd2udjj0W=s64","userId":"12399453063503639914"}},"outputId":"dbeeaa5d-2072-44fe-8314-81f32ab61327"},"source":["!pip install neo4j"],"execution_count":13,"outputs":[{"output_type":"stream","text":["Requirement already satisfied: neo4j in /usr/local/lib/python3.7/dist-packages (4.3.1)\n","Requirement already satisfied: pytz in /usr/local/lib/python3.7/dist-packages (from neo4j) (2018.9)\n"],"name":"stdout"}]},{"cell_type":"code","metadata":{"id":"fhmJ1QEdC-4e","executionInfo":{"status":"ok","timestamp":1623140272485,"user_tz":-120,"elapsed":81,"user":{"displayName":"Raphaël Azorin","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gg1zZn5o5tIlK5J3P6RdcBMqTBjo6bOd2udjj0W=s64","userId":"12399453063503639914"}}},"source":["ip = \"54.172.14.140\"\n","bolt_port = \"7687\"\n","username = \"neo4j\"\n","password = \"rifle-sponsor-beliefs\""],"execution_count":14,"outputs":[]},{"cell_type":"code","metadata":{"id":"RI-e7X2UuOgR","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1623140272490,"user_tz":-120,"elapsed":69,"user":{"displayName":"Raphaël Azorin","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gg1zZn5o5tIlK5J3P6RdcBMqTBjo6bOd2udjj0W=s64","userId":"12399453063503639914"}},"outputId":"a325295a-fc84-41f7-8abb-d9e6b1db0a52"},"source":["from neo4j import GraphDatabase\n","\n","driver = GraphDatabase.driver(\"bolt://\" + ip + \":\" + bolt_port, auth=(username, password))\n","\n","print(driver.address) # your-sandbox-ip:your-sandbox-bolt-port"],"execution_count":15,"outputs":[{"output_type":"stream","text":["54.172.14.140:7687\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"nWqz69-VuOgQ"},"source":["# Citation Dataset Loading\n","\n","In this notebook we're going to load the citation dataset into Neo4j."]},{"cell_type":"markdown","metadata":{"id":"RXVLAZcyXe6v"},"source":["## Reset database\n","Ensure you start with a clean and empty database in your Sandbox (it may be pre-loaded with toy data). To do so, run the following cell to delete all nodes and relationships.\n","\n"]},{"cell_type":"code","metadata":{"colab":{"base_uri":"https://localhost:8080/"},"id":"by1gXcnOXMP4","executionInfo":{"status":"ok","timestamp":1623139605861,"user_tz":-120,"elapsed":9106,"user":{"displayName":"Raphaël Azorin","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gg1zZn5o5tIlK5J3P6RdcBMqTBjo6bOd2udjj0W=s64","userId":"12399453063503639914"}},"outputId":"c7f77e33-58a1-4e38-b0e2-b7437a9badb8"},"source":["query = \"\"\"\n","  CALL apoc.periodic.iterate(\n","    \"MATCH (n) RETURN n\", \n","    \"DETACH DELETE n\", \n","    {batchSize:1000}\n","  )\n","  yield batches, total return batches, total\n","\"\"\"\n","\n","with driver.session() as session:\n","  result = session.run(query)\n","  for row in result:\n","    print(row)"],"execution_count":null,"outputs":[{"output_type":"stream","text":["<Record batches=3 total=2642>\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"ZNlvzmkbuOgU"},"source":["## Create Constraints\n","\n","First let's create some constraints to make sure we won't import duplicate data. We basically use an attribute as an ID for each type of node that we will create."]},{"cell_type":"code","metadata":{"id":"Z0zNkfh0uOgU","colab":{"base_uri":"https://localhost:8080/","height":68},"executionInfo":{"status":"ok","timestamp":1623139607731,"user_tz":-120,"elapsed":1896,"user":{"displayName":"Raphaël Azorin","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gg1zZn5o5tIlK5J3P6RdcBMqTBjo6bOd2udjj0W=s64","userId":"12399453063503639914"}},"outputId":"04b73f26-650f-4147-b8c9-6b4492b2f3c9"},"source":["with driver.session() as session:\n","    display(session.run(\"CREATE CONSTRAINT ON (a:Article) ASSERT a.index IS UNIQUE\").consume().counters)\n","    display(session.run(\"CREATE CONSTRAINT ON (a:Author) ASSERT a.name IS UNIQUE\").consume().counters)\n","    display(session.run(\"CREATE CONSTRAINT ON (v:Venue) ASSERT v.name IS UNIQUE\").consume().counters)"],"execution_count":null,"outputs":[{"output_type":"display_data","data":{"text/plain":["{'constraints_added': 1}"]},"metadata":{"tags":[]}},{"output_type":"display_data","data":{"text/plain":["{'constraints_added': 1}"]},"metadata":{"tags":[]}},{"output_type":"display_data","data":{"text/plain":["{'constraints_added': 1}"]},"metadata":{"tags":[]}}]},{"cell_type":"markdown","metadata":{"id":"u8aTpOD9uOgV"},"source":["## Load the data\n","\n","Now let's load the data into the database. We will create nodes and relationships for *Articles*, *Venues*, and *Authors* from JSON files that represent an extract of the DBLP dataset. \n"]},{"cell_type":"code","metadata":{"id":"iob06rOBuOgV","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1623139710275,"user_tz":-120,"elapsed":22872,"user":{"displayName":"Raphaël Azorin","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gg1zZn5o5tIlK5J3P6RdcBMqTBjo6bOd2udjj0W=s64","userId":"12399453063503639914"}},"outputId":"5652ac16-acc7-4e68-b8f7-e80fa989f617"},"source":["query = \"\"\"\n","CALL apoc.periodic.iterate(\n","  'UNWIND [\"dblp-ref-0.json\", \"dblp-ref-1.json\", \"dblp-ref-2.json\", \"dblp-ref-3.json\"] AS file\n","   CALL apoc.load.json(\"https://github.com/mneedham/link-prediction/raw/master/data/\" + file)\n","   YIELD value WITH value\n","   RETURN value',\n","  'MERGE (a:Article {index:value.id})\n","   SET a += apoc.map.clean(value,[\"id\",\"authors\",\"references\", \"venue\"],[0])\n","   WITH a, value.authors as authors, value.references AS citations, value.venue AS venue\n","   MERGE (v:Venue {name: venue})\n","   MERGE (a)-[:VENUE]->(v)\n","   FOREACH(author in authors | \n","     MERGE (b:Author{name:author})\n","     MERGE (a)-[:AUTHOR]->(b))\n","   FOREACH(citation in citations | \n","     MERGE (cited:Article {index:citation})\n","     MERGE (a)-[:CITED]->(cited))', \n","   {batchSize: 500, iterateList: true});\n","\"\"\"\n","\n","with driver.session() as session:\n","    result = session.run(query)\n","    for row in result:\n","        print(row)"],"execution_count":null,"outputs":[{"output_type":"stream","text":["<Record batches=104 total=51956 timeTaken=19 committedOperations=51956 failedOperations=0 failedBatches=0 retries=0 errorMessages={} batch={'total': 104, 'committed': 104, 'failed': 0, 'errors': {}} operations={'total': 51956, 'committed': 51956, 'failed': 0, 'errors': {}} wasTerminated=False failedParams={} updateStatistics={'nodesDeleted': 0, 'labelsAdded': 43696, 'relationshipsCreated': 78585, 'nodesCreated': 43696, 'propertiesSet': 229418, 'relationshipsDeleted': 0, 'labelsRemoved': 0}>\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"osVOJT9YFNaq"},"source":["Let's check that we did not create any *Article* without title."]},{"cell_type":"code","metadata":{"id":"BY3LxcPpuOgV","colab":{"base_uri":"https://localhost:8080/"},"executionInfo":{"status":"ok","timestamp":1623139828868,"user_tz":-120,"elapsed":11300,"user":{"displayName":"Raphaël Azorin","photoUrl":"https://lh3.googleusercontent.com/a-/AOh14Gg1zZn5o5tIlK5J3P6RdcBMqTBjo6bOd2udjj0W=s64","userId":"12399453063503639914"}},"outputId":"e5935f16-f73a-4c55-8afe-595717bdcd59"},"source":["query = \"\"\"\n","  call apoc.periodic.iterate(\n","    'MATCH (a:Article) WHERE not(exists(a.title)) RETURN a',\n","    'DETACH DELETE a',\n","    {batchSize:1000}\n","  )\n","  yield batches, total return batches, total\n","\"\"\"\n","\n","with driver.session() as session:\n","    result = session.run(query)\n","    for row in result:\n","        print(row)"],"execution_count":null,"outputs":[{"output_type":"stream","text":["<Record batches=133 total=132357>\n"],"name":"stdout"}]},{"cell_type":"markdown","metadata":{"id":"PIzCuwhoFk8s"},"source":["# Explore the data\n","\n","Let's use the intuitive Neo4J Browser to explore the data that we have imported using Cypher queries. To access the Browser, go to your Sandbox control panel (at https://sandbox.neo4j.com/) and click the *Open* button.\n","\n","Here are some queries left as exercise to explore your newly created DBLP database in the Neo4J Browser. Various solutions are valid for each question. Hint: use the \"LIMIT\" clause to avoid returning too many results and slowing down your queries."]},{"cell_type":"markdown","metadata":{"id":"lnN_1uCe9tXW"},"source":["- Show some *Articles* and their *Author*"]},{"cell_type":"code","metadata":{"id":"WES89L9F9uiI","cellView":"form"},"source":["#@title Solution\n","\n","MATCH (a:Article)-[:AUTHOR]-(b) \n","RETURN a.title, b.name \n","LIMIT 50"],"execution_count":null,"outputs":[]},{"cell_type":"markdown","metadata":{"id":"XIcO9Fay8Y5N"},"source":["- Show some articles that talk about \"random forests\". Hint: use their *title* and *abstract* properties."]},{"cell_type":"code","metadata":{"id":"wV80xcsE7Zu6","cellView":"form"},"source":["#@title Solution\n","\n","MATCH (a:Article) \n","WHERE toLower(a.title) CONTAINS 'random forest' OR toLower(a.abstract) CONTAINS 'random forest'\n","RETURN a.title, a.abstract \n","LIMIT 50"],"execution_count":null,"outputs":[]},{"cell_type":"markdown","metadata":{"id":"N9M2KLgp7fm2"},"source":["- Get the total number of *Article*, *Author* and *Venue* in the database. Hint: use nodes' \"LABEL\"."]},{"cell_type":"code","metadata":{"id":"lQ2gaEkRhnVq","cellView":"form"},"source":["#@title Solution\n","\n","MATCH(n) \n","RETURN LABELS(n), COUNT(n)"],"execution_count":null,"outputs":[]},{"cell_type":"markdown","metadata":{"id":"vUWwPpGu7vM5"},"source":["- Get the number of relationships for each type (*VENUE*, *CITED*, ...). Hint: use relationships' \"TYPE\"."]},{"cell_type":"code","metadata":{"id":"bu3Ln9kPhoMV","cellView":"form"},"source":["#@title Solution\n","\n","MATCH ()-[r]->() \n","RETURN TYPE(r), COUNT(r)"],"execution_count":null,"outputs":[]},{"cell_type":"markdown","metadata":{"id":"GuInaqBV_g9Q"},"source":["- Find the most cited *Article*.\n"]},{"cell_type":"code","metadata":{"id":"JK4LYCK0_lzd","cellView":"form"},"source":["#@title Solution\n","\n","MATCH (a:Article)<-[:CITED]-(b:Article) \n","RETURN a.title, COUNT(b) as citations\n","ORDER BY citations desc\n","LIMIT 1"],"execution_count":null,"outputs":[]},{"cell_type":"markdown","metadata":{"id":"VffHp0AfANp9"},"source":["- Find the Top 10 *Author*s with the most collaborations. We count one collaboration as one article written by several authors."]},{"cell_type":"code","metadata":{"id":"IZVD_rrWAaae","cellView":"form"},"source":["#@title Solution\n","\n","MATCH (a:Author)<-[:AUTHOR]-(b:Article)-[:AUTHOR]->(c:Author) \n","WHERE a <> c\n","RETURN a.name, COUNT(DISTINCT b) as collabs\n","ORDER BY collabs DESC\n","LIMIT 10"],"execution_count":null,"outputs":[]},{"cell_type":"markdown","metadata":{"id":"WCTXHIp_A92l"},"source":["- Find the *Author* with whom \"Salvatore Greco\" has co-authored the most with."]},{"cell_type":"code","metadata":{"id":"IcYylhPVDSI4","cellView":"form"},"source":["#@title Solution\n","\n","MATCH (a:Author)<-[:AUTHOR]-(b:Article)-[:AUTHOR]->(c:Author) \n","WHERE a.name = \"Salvatore Greco\"\n","RETURN a.name, c.name, COUNT(DISTINCT b) as collabs\n","ORDER BY collabs DESC\n","LIMIT 1"],"execution_count":null,"outputs":[]},{"cell_type":"markdown","metadata":{"id":"3wPADkaKKXZe"},"source":["How could we use this last query as a basis to recommend future collaborations to Salvatore Greco? To make this easier, we will need to infer a graph of co-authorship."]}]}